import random

print('Привет, давай сыграем в известную игру "Камень, ножницы, бумага"')
print('Введи оружие в формале "камень", "ножницы", "бумага"')
for i in range(3):
    move_pc = random.randint(1,3)
    if move_pc == 1:
        move_pc = 'камень'
    elif move_pc == 2:
        move_pc = 'ножницы'
    elif move_pc == 3:
        move_pc = 'бумага'
    print('Введи свое "оружие":')
    move = input()
    
    if move == move_pc:
        print('Напиши еще раз, у нас совпали оружия')
    elif move == 'камень' and move_pc == 'бумага':
        print('Я выиграл, давай еще!')
    elif move == 'камень' and move_pc == 'ножницы':
        print('Ты выиграл, давай еще!')
    elif move == 'ножницы' and move_pc == 'камень':
        print('Я выиграл, давай еще!') # 🛠️ ИСПРАВИЛИ: тут побеждает ПК (камень бьет ножницы)
    elif move == 'ножницы' and move_pc == 'бумага':
            print('Ты выиграл, давай еще!') # 🛠️ ИСПРАВИЛИ: тут побеждает игрок (ножницы режут бумагу)
    elif move == 'бумага' and move_pc == 'ножницы':
                print('Я выиграл, давай еще!')
    elif move == 'бумага' and move_pc == 'камень':
                print('Ты выиграл, давай еще!')
    else:

        print('Введи оружие в формале "камень", "ножницы", "бумага"')
